benchmark/results/wrk-gogo-multi.log
== gogo [multi] /hello  t=1 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3002/hello
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03ms    1.61ms  38.66ms   99.25%
    Req/Sec   277.88k    19.56k  293.93k    92.00%
  Latency Distribution
     50%    0.90ms
     75%    0.93ms
     90%    0.98ms
     99%    2.09ms
  1384452 requests in 5.01s, 192.77MB read
Requests/sec: 276421.92
Transfer/sec:     38.49MB
== gogo [multi] /hello  t=4 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3002/hello
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.70ms  595.84us  17.81ms   91.87%
    Req/Sec    73.11k     9.16k  102.75k    85.22%
  Latency Distribution
     50%    1.59ms
     75%    1.66ms
     90%    1.85ms
     99%    3.73ms
  1476185 requests in 5.10s, 205.54MB read
Requests/sec: 289370.93
Transfer/sec:     40.29MB
== gogo [multi] /hello/inon  t=1 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3002/hello/inon
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.97ms  239.62us   7.24ms   94.87%
    Req/Sec   277.12k    16.05k  294.49k    86.00%
  Latency Distribution
     50%    0.91ms
     75%    0.95ms
     90%    1.06ms
     99%    2.12ms
  1378903 requests in 5.01s, 190.68MB read
Requests/sec: 275379.54
Transfer/sec:     38.08MB
== gogo [multi] /hello/inon  t=4 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3002/hello/inon
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78ms  418.79us   7.69ms   87.84%
    Req/Sec    69.79k    15.28k  271.29k    96.52%
  Latency Distribution
     50%    1.71ms
     75%    1.80ms
     90%    2.16ms
     99%    3.41ms
  1396054 requests in 5.10s, 193.05MB read
Requests/sec: 273656.34
Transfer/sec:     37.84MB
== gogo [multi] /db  t=1 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3002/db
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.37ms  785.36us  43.80ms   89.69%
    Req/Sec   197.55k    23.72k  219.20k    86.00%
  Latency Distribution
     50%    2.26ms
     75%    2.45ms
     90%    2.76ms
     99%    5.68ms
  983677 requests in 5.01s, 185.45MB read
Requests/sec: 196187.14
Transfer/sec:     36.99MB
== gogo [multi] /db  t=4 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3002/db
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.52ms    1.03ms 115.49ms   91.76%
    Req/Sec    48.50k     5.18k   57.68k    82.84%
  Latency Distribution
     50%    2.36ms
     75%    2.54ms
     90%    2.97ms
     99%    6.25ms
  984395 requests in 5.10s, 185.58MB read
Requests/sec: 192898.20
Transfer/sec:     36.37MB