benchmark/results/wrk-gogo-multi.log
== gogo [multi] GET /hello  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/hello
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.00ms  179.89us   4.02ms   90.69%
    Req/Sec   254.14k     7.48k  267.48k    70.00%
  Latency Distribution
     50%    0.95ms
     75%    0.99ms
     90%    1.15ms
     99%    1.76ms
  2528158 requests in 10.01s, 352.01MB read
Requests/sec: 252685.11
Transfer/sec:     35.18MB
== gogo [multi] GET /hello  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/hello
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.20ms  493.98us   8.19ms   79.92%
    Req/Sec   129.79k     4.41k  137.97k    81.50%
  Latency Distribution
     50%    1.07ms
     75%    1.40ms
     90%    1.83ms
     99%    2.94ms
  2584621 requests in 10.01s, 359.87MB read
Requests/sec: 258270.70
Transfer/sec:     35.96MB
== gogo [multi] GET /hello  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/hello
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.82ms    2.75ms  69.78ms   94.49%
    Req/Sec    60.30k     9.70k   95.53k    70.25%
  Latency Distribution
     50%    1.21ms
     75%    2.19ms
     90%    3.45ms
     99%   11.98ms
  2406789 requests in 10.05s, 335.11MB read
Requests/sec: 239520.98
Transfer/sec:     33.35MB
== gogo [multi] GET /hello  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/hello
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.54ms    9.92ms 161.09ms   92.80%
    Req/Sec    28.79k     5.89k   50.07k    73.78%
  Latency Distribution
     50%    1.38ms
     75%    4.20ms
     90%   11.28ms
     99%   48.73ms
  2295783 requests in 10.07s, 319.66MB read
Requests/sec: 227953.15
Transfer/sec:     31.74MB
== gogo [multi] GET /hello/inon  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/hello/inon
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.11ms  219.85us   3.36ms   90.25%
    Req/Sec   230.37k     5.71k  237.31k    94.00%
  Latency Distribution
     50%    1.04ms
     75%    1.08ms
     90%    1.31ms
     99%    2.02ms
  2292580 requests in 10.01s, 317.02MB read
Requests/sec: 229070.07
Transfer/sec:     31.68MB
== gogo [multi] GET /hello/inon  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/hello/inon
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms  528.21us  10.36ms   80.60%
    Req/Sec   120.94k     5.93k  135.12k    70.50%
  Latency Distribution
     50%    1.14ms
     75%    1.49ms
     90%    1.94ms
     99%    3.15ms
  2406983 requests in 10.01s, 332.84MB read
Requests/sec: 240500.03
Transfer/sec:     33.26MB
== gogo [multi] GET /hello/inon  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/hello/inon
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.00ms    3.25ms  88.32ms   94.31%
    Req/Sec    56.99k     9.69k   90.49k    72.75%
  Latency Distribution
     50%    1.23ms
     75%    2.35ms
     90%    3.88ms
     99%   14.05ms
  2278616 requests in 10.07s, 315.09MB read
Requests/sec: 226191.22
Transfer/sec:     31.28MB
== gogo [multi] GET /hello/inon  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/hello/inon
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.10ms    8.57ms 131.97ms   92.81%
    Req/Sec    28.15k     5.89k  128.12k    84.12%
  Latency Distribution
     50%    1.41ms
     75%    4.19ms
     90%   10.13ms
     99%   35.49ms
  2248554 requests in 10.10s, 310.94MB read
Requests/sec: 222652.79
Transfer/sec:     30.79MB
== gogo [multi] GET /db  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/db
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.84ms    1.33ms 129.39ms   96.14%
    Req/Sec   156.25k    12.99k  168.20k    90.00%
  Latency Distribution
     50%    2.77ms
     75%    3.08ms
     90%    3.55ms
     99%    5.68ms
  1554635 requests in 10.01s, 293.08MB read
Requests/sec: 155322.13
Transfer/sec:     29.28MB
== gogo [multi] GET /db  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/db
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.10ms    2.12ms 117.74ms   96.31%
    Req/Sec    79.58k     7.44k  109.11k    81.00%
  Latency Distribution
     50%    2.93ms
     75%    3.23ms
     90%    3.71ms
     99%    8.59ms
  1583663 requests in 10.01s, 298.55MB read
Requests/sec: 158208.52
Transfer/sec:     29.83MB
== gogo [multi] GET /db  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/db
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.99ms    7.82ms 417.83ms   97.73%
    Req/Sec    35.54k     5.81k   61.98k    78.50%
  Latency Distribution
     50%    3.16ms
     75%    3.81ms
     90%    4.77ms
     99%   23.37ms
  1418194 requests in 10.05s, 267.36MB read
Requests/sec: 141099.36
Transfer/sec:     26.60MB
== gogo [multi] GET /db  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/db
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.97ms    6.95ms 336.66ms   96.87%
    Req/Sec    18.70k     4.88k  137.82k    97.38%
  Latency Distribution
     50%    3.13ms
     75%    3.82ms
     90%    5.42ms
     99%   21.21ms
  1491209 requests in 10.10s, 281.13MB read
Requests/sec: 147614.38
Transfer/sec:     27.83MB
== gogo [multi] POST /echo  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/echo
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.35ms  315.66us   5.23ms   88.08%
    Req/Sec   191.89k     7.57k  214.38k    78.00%
  Latency Distribution
     50%    1.24ms
     75%    1.34ms
     90%    1.78ms
     99%    2.53ms
  1912751 requests in 10.02s, 321.05MB read
Requests/sec: 190877.27
Transfer/sec:     32.04MB
== gogo [multi] POST /echo  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/echo
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.68ms    1.24ms  32.96ms   88.36%
    Req/Sec   107.90k     6.80k  129.49k    84.50%
  Latency Distribution
     50%    1.40ms
     75%    2.09ms
     90%    2.93ms
     99%    4.89ms
  2148855 requests in 10.01s, 360.68MB read
Requests/sec: 214638.67
Transfer/sec:     36.03MB
== gogo [multi] POST /echo  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/echo
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.83ms    4.67ms 134.03ms   93.85%
    Req/Sec    49.96k    10.11k   77.74k    74.94%
  Latency Distribution
     50%    1.63ms
     75%    3.12ms
     90%    5.54ms
     99%   23.23ms
  1992228 requests in 10.08s, 334.39MB read
Requests/sec: 197560.53
Transfer/sec:     33.16MB
== gogo [multi] POST /echo  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/echo
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.63ms    7.05ms 133.23ms   94.01%
    Req/Sec    25.13k     4.31k   52.16k    77.25%
  Latency Distribution
     50%    1.76ms
     75%    3.92ms
     90%    7.71ms
     99%   27.99ms
  2005448 requests in 10.08s, 336.61MB read
Requests/sec: 198976.55
Transfer/sec:     33.40MB
== gogo [multi] POST /query  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/query
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.78ms    1.42ms 137.99ms   96.66%
    Req/Sec   152.16k    14.17k  164.56k    86.00%
  Latency Distribution
     50%    2.70ms
     75%    3.09ms
     90%    3.58ms
     99%    5.72ms
  1515040 requests in 10.02s, 281.75MB read
Requests/sec: 151216.14
Transfer/sec:     28.12MB
== gogo [multi] POST /query  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/query
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.10ms    2.23ms 223.56ms   95.61%
    Req/Sec    77.30k     9.46k  121.23k    83.00%
  Latency Distribution
     50%    2.94ms
     75%    3.30ms
     90%    3.90ms
     99%    8.99ms
  1540213 requests in 10.02s, 286.43MB read
Requests/sec: 153657.96
Transfer/sec:     28.58MB
== gogo [multi] POST /query  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/query
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.84ms    7.21ms 486.71ms   97.08%
    Req/Sec    36.86k     6.67k   60.20k    73.50%
  Latency Distribution
     50%    3.00ms
     75%    3.70ms
     90%    5.13ms
     99%   21.45ms
  1470381 requests in 10.04s, 273.44MB read
Requests/sec: 146422.28
Transfer/sec:     27.23MB
== gogo [multi] POST /query  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3002/query
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.91ms    5.98ms 292.73ms   95.91%
    Req/Sec    18.74k     1.93k   32.18k    74.72%
  Latency Distribution
     50%    3.04ms
     75%    3.85ms
     90%    5.89ms
     99%   20.43ms
  1505329 requests in 10.11s, 279.94MB read
Requests/sec: 148903.82
Transfer/sec:     27.69MB